<?php
/**
 добавь в дневник веса день недели
 так будет удобно понимать цикличность
: и возможность выделенияна графике недельных циклов полутонами какими-то
 спасибо
 мой отзывчивый друг
 и, возможно, прамая с указанием тренда внутри периода
 скажем тренд квартала
 как бы тонкая линия внутри графика которая исходит от неких средних показателей
 и показываетдинамику
: ведь порой сложно увидеть если на протяжении нескольких недель к тебя играет пара кило
 туда-сюда и непонятно какова динамика
 а так - некое среднее где сумма всех кг делится на все дни им т.д.
 с учетом того что участник может пропустить в заполнении несколько дней
 впрочем
 если сделаешь хотя бы дни - будет очень хорошо )))
 *
+ сам тренд, прямая линия + возможность показывать или прятать его - какие-то кнопочки + кнопочки сами где-то разместить.
 начну, а там посмотрим

 *
 */

/**

2) Выделение на графике недельных циклов полутонами
 *
 * can't be done
 *
 *
 *
3) Прямая с указанием тренда внутри периода
 *
 *
 */
?>
