<?php
/**
 *
 *[22:23:03] Alex: уточни настройки графика. По данному номеру недели строить график недели,
 *по данному дню недели строить график веса в этот день недели  в году,
 * по данному номеру месяца строить график веса в этот месяце
[22:23:21] Alex: + печать

 * 1. почти никогда не запоминает пользователя.
[22:26:05] Василий Ковалевский: 2. дни недели в г8рафе ввода данных
[22:26:22] Василий Ковалевский: 3. возможно диапазон при вводе данных показывать больший
[22:26:34] Василий Ковалевский: 4. может сделать еженедельную рассылку с данными и анализом????
и справа сделай тоже ось
 *  … вижу на графике добавил - аляповато
[22:33:04] Василий Ковалевский: меняй на сокращения
[22:33:34] Василий Ковалевский: и увеличь график вертикально
[22:33:39] Василий Ковалевский: пусть пол экрана занимает
[22:33:49] Василий Ковалевский: это же самое увлекательное  - килограммы!!!!

[22:34:19] Василий Ковалевский: ординат или как там она называется
[22:34:28] Alex: да, ординат
[22:36:46] Василий Ковалевский: да, ввод веса делай на семь недельных дней
[22:36:53] Василий Ковалевский: выходные сделай не синими а красными
[22:36:59] Alex: логично
[22:37:08] Василий Ковалевский: кроме того мелким шрифтом можно ставить показатель прошлой недели
типа фоновое такое
[22:37:33] Василий Ковалевский: тиа справа вваерху от весов так меленько
[22:37:35] Василий Ковалевский: чтобы понимать
[22:37:39] Василий Ковалевский: что ты сука переел!!!
[22:38:26] Василий Ковалевский: но по графику главное точки уменьши
[22:38:38] Василий Ковалевский: и цвет сделай поспокойнее - а то долго невозможно с графиком работать ))))
 **/

/**
 * DONE 1. Print button.
 * 2. Build graph by week day for year.
 * 3. Build graph for given month
 * 4. Build graph for given week
 * DONE 5. Shorten week day names for shortened
 * DONE 6. Decrease size of bullets on graph (or make it dependent on amount points on graph)
 * DONE 7. Add one more value axis.
 * DONE 8. Make graph color calmer.
 * DONE 9. Increase graph size vertically.
 *
 * DONE? 10. Remember user, fix cookies. // ? seems it works already. Just do not logout
 *
 * DONE 11. Add week days on data input.
 * DONE 12. Make data input for 7 days.
 * DONE 14. Make weekends red.
 * DONE 13. For data input display weight of the same weekday of last week in small size letters
 *
 * DONE 15. Create blog. Add link to this blog to site.
 **/
?>
