<?php
/**
 *
 *[22:23:03] Alex: уточни настройки графика. По данному номеру недели строить график недели,
 *по данному дню недели строить график веса в этот день недели  в году,
 * по данному номеру месяца строить график веса в этот месяце
[22:23:21] Alex: + печать

 * 1. почти никогда не запоминает пользователя.
[22:26:05] Василий Ковалевский: 2. дни недели в г8рафе ввода данных
[22:26:22] Василий Ковалевский: 3. возможно диапазон при вводе данных показывать больший
[22:26:34] Василий Ковалевский: 4. может сделать еженедельную рассылку с данными и анализом????
и справа сделай тоже ось
 *  … вижу на графике добавил - аляповато
[22:33:04] Василий Ковалевский: меняй на сокращения
[22:33:34] Василий Ковалевский: и увеличь график вертикально
[22:33:39] Василий Ковалевский: пусть пол экрана занимает
[22:33:49] Василий Ковалевский: это же самое увлекательное  - килограммы!!!!

[22:34:19] Василий Ковалевский: ординат или как там она называется
[22:34:28] Alex: да, ординат
[22:36:46] Василий Ковалевский: да, ввод веса делай на семь недельных дней
[22:36:53] Василий Ковалевский: выходные сделай не синими а красными
[22:36:59] Alex: логично
[22:37:08] Василий Ковалевский: кроме того мелким шрифтом можно ставить показатель прошлой недели
типа фоновое такое
[22:37:33] Василий Ковалевский: тиа справа вваерху от весов так меленько
[22:37:35] Василий Ковалевский: чтобы понимать
[22:37:39] Василий Ковалевский: что ты сука переел!!!
[22:38:26] Василий Ковалевский: но по графику главное точки уменьши
[22:38:38] Василий Ковалевский: и цвет сделай поспокойнее - а то долго невозможно с графиком работать ))))
 **/

/**
 * DONE 1. Кнопочка печати
 * 2. Строить график по данному дню недели (за год)
 * 3. Строить график по данному месяцу
 * 4. Строить график по данному номеру недели
 * DONE 5. Сменить дни недели на графике на сокращенные.
 * DONE 6. Уменьшить размер отметок на графике ( или сделать его зависимым от количества точек на графике.. чем больше точек,тем меньше размер)
 * 7. Добавить справа ось ординат.
 * DONE 8. Цвет поспокойней графика.
 * 9. Увеличить вертикальный размер графика.
 *
 * 10. Запоминать пользователя, куки
 *
 * 11. Писать дни недели при вводе данных
 * 12. Ввод веса на 7 дней. Выходные красным цветом.
 * 13. При вводе мелким шрифтом отображать показатель прошлой недели.
 */
?>
